lib/sem4r_debug_client/requests_xml/campaign_get.xml


<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v201008/CampaignService' -->
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns="https://adwords.google.com/api/adwords/cm/v201008"
              xmlns:s="https://adwords.google.com/api/adwords/cm/v201008">
   <env:Header>
      <s:RequestHeader env:mustUnderstand="0">
        <authToken><%=@auth_token%></authToken>
        <developerToken><%=@developer_token%></developerToken>
        <clientEmail><%=@client_email%></clientEmail>
         <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
      </s:RequestHeader>
   </env:Header>
   <env:Body>
      <get>
         <selector>
            <campaignStatuses>ACTIVE</campaignStatuses>
            <campaignStatuses>PAUSED</campaignStatuses>
            <statsSelector>

               <dateRange>
                  <min>20090101</min>
                  <max>20091231</max>
               </dateRange>
            </statsSelector>
         </selector>
      </get>
   </env:Body>

</env:Envelope>
